## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_manifest.certificate_argo_argo will be updated in-place
!   resource "kubernetes_manifest" "certificate_argo_argo" {
!       manifest = {
!           spec       = {
!               secretName = "wayofthesys-org-tls" -> "argocd-tls"
                # (3 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }
!       object   = {
!           spec       = {
!               secretName              = "wayofthesys-org-tls" -> "argocd-tls"
                # (18 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }
    }

  # kubernetes_manifest.cinema-gateway will be created
+   resource "kubernetes_manifest" "cinema-gateway" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               name      = "cinema"
+               namespace = "cinema"
            }
+           spec       = {
+               selector = {
+                   istio = "ingressgateway"
                }
+               servers  = [
+                   {
+                       hosts = [
+                           "wayofthesys.org",
                        ]
+                       port  = {
+                           name     = "http"
+                           number   = 80
+                           protocol = "HTTP"
                        }
+                       tls   = {
+                           httpsRedirect = false
                        }
                    },
+                   {
+                       hosts = [
+                           "wayofthesys.org",
                        ]
+                       port  = {
+                           name     = "https"
+                           number   = 443
+                           protocol = "HTTPS"
                        }
+                       tls   = {
+                           credentialName    = "wayofthesys-org-tls"
+                           mode              = "SIMPLE"
+                           privateKey        = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate = "/etc/istio/ingressgateway-certs/tls.crt"
                        }
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "cinema"
+               namespace                  = "cinema"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               selector = {
+                   "istio" = "ingressgateway"
                }
+               servers  = [
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "wayofthesys.org",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "http"
+                           number     = 80
+                           protocol   = "HTTP"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = (known after apply)
+                           httpsRedirect         = false
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = (known after apply)
+                           privateKey            = (known after apply)
+                           serverCertificate     = (known after apply)
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "wayofthesys.org",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "https"
+                           number     = 443
+                           protocol   = "HTTPS"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = "wayofthesys-org-tls"
+                           httpsRedirect         = (known after apply)
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = "SIMPLE"
+                           privateKey            = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate     = "/etc/istio/ingressgateway-certs/tls.crt"
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
                ]
            }
        }
    }

  # kubernetes_secret.argocd-tls must be replaced
-/+ resource "kubernetes_secret" "argocd-tls" {
!       id        = "istio-system/argo-cert" -> (known after apply)
-       immutable = false -> null
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 0 -> (known after apply)
-           labels           = {} -> null
!           name             = "argo-cert" -> "argocd-tls" # forces replacement
!           resource_version = "1287928" -> (known after apply)
!           uid              = "444db22e-a38b-499a-ba9e-fee7dec0b9d4" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # kubernetes_secret.wayofthesys-tls will be created
+   resource "kubernetes_secret" "wayofthesys-tls" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "tls"

+       metadata {
+           generation       = (known after apply)
+           name             = "wayofthesys-org-tls"
+           namespace        = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 3 to add, 1 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
